In [1]:
import pandas as pd

In [2]:
data = pd.Series((1,2,3,5,6))

In [3]:
data

0    1
1    2
2    3
3    5
4    6
dtype: int64

In [4]:
pd.DataFrame([["hi",2.0,3.6,4,5],["hello",2,3,4,5]],columns = ["one","two","three","four","five"],index = ["first","second"])

          one  two  three  four  five
first      hi  2.0    3.6     4     5
second  hello  2.0    3.0     4     5

In [9]:
data = pd.read_csv('usedcars.csv')

In [12]:
data.shape

(150, 6)

In [15]:
data.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [18]:
data.tail()

     year model  price  mileage   color transmission
145  2006   SES   6200    95000  Silver         AUTO
146  2002    SE   5995    87003     Red         AUTO
147  2000    SE   5980    96841     Red         AUTO
148  2001    SE   4899   151479  Yellow         AUTO
149  2000    SE   3800   109259     Red         AUTO

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       150 non-null    int64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: int64(3), object(3)
memory usage: 7.2+ KB

In [20]:
data.describe()

              year         price        mileage
count   150.000000    150.000000     150.000000
mean   2008.726667  12961.933333   44260.646667
std       2.200966   3122.481735   26982.104322
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   27200.250000
50%    2009.000000  13591.500000   36385.000000
75%    2010.000000  14904.500000   55124.500000
max    2012.000000  21992.000000  151479.000000

In [21]:
data.columns.tolist()

['year', 'model', 'price', 'mileage', 'color', 'transmission']

In [22]:
data.index

RangeIndex(start=0, stop=150, step=1)

In [33]:
data.iloc[0::10]

     year model  price  mileage   color transmission
0    2011   SEL  21992     7413  Yellow         AUTO
10   2010   SES  16995    40539   Black         AUTO
20   2010   SES  15988    16035  Silver       MANUAL
30   2010   SES  14999    36306     Red         AUTO
40   2010   SES  14761    44813   Black         AUTO
50   2010    SE  14299    36447   Black         AUTO
60   2010    SE  13992    21721   Green         AUTO
70   2009   SES  13799    34888   Black         AUTO
80   2009   SES  12999    32403    Blue         AUTO
90   2009    SE  12992    27136    Gray         AUTO
100  2009    SE  12500    54988   White       MANUAL
110  2008    SE  11450    85229     Red       MANUAL
120  2010    SE  10717    64199   Black         AUTO
130  2007    SE   8996    48652  Silver       MANUAL
140  2004    SE   6999   105714  Silver         AUTO

In [35]:
data.loc[0:10,'year':'mileage']

    year model  price  mileage
0   2011   SEL  21992     7413
1   2011   SEL  20995    10926
2   2011   SEL  19995     7351
3   2011   SEL  17809    11613
4   2012    SE  17500     8367
5   2010   SEL  17495    25125
6   2011   SEL  17000    27393
7   2010   SEL  16995    21026
8   2011   SES  16995    32655
9   2010   SES  16995    36116
10  2010   SES  16995    40539

In [47]:
data[['mileage','year']]

     mileage  year
0       7413  2011
1      10926  2011
2       7351  2011
3      11613  2011
4       8367  2012
..       ...   ...
145    95000  2006
146    87003  2002
147    96841  2000
148   151479  2001
149   109259  2000

[150 rows x 2 columns]